# Look & Feel
anseki.vscode-color
robertohuertasm.vscode-icons
idleberg.icon-fonts
zhuangtongfa.Material-theme
# Editing
aaron-bond.better-comments
bmewburn.vscode-intelephense-client
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
esbenp.prettier-vscode
fernandoescolar.vscode-solution-explorer
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
HookyQR.beautify
oderwat.indent-rainbow
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
# Language support
## C/C++
ms-vscode.cpptools
austin.code-gnu-global
## C#
ms-vscode.csharp
craigthomas.supersharp
jchannon.csharpextensions
jorgeserrano.vscode-csharp-snippets
Leopotam.csharpfixformat
## Core
doggy8088.netcore-extension-pack
doggy8088.netcore-snippets
## dotnet
formulahendry.dotnet
formulahendry.dotnet-test-explorer
jmrog.vscode-nuget-package-manager
schneiderpat.aspnet-helper
tintoy.msbuild-project-tools
alefragnani.project-manager
## Database
bajdzis.vscode-database
ms-mssql.mssql
ms-ossdata.vscode-postgresql
## Dart/Flutter
Dart-Code.dart-code
Dart-Code.flutter
## GO
ms-vscode.Go
## HTML/CSS
thekalinga.bootstrap4-vscode
abusaidm.html-snippets
clinyong.vscode-css-modules
robinbentley.sass-indented
wcwhitehead.bootstrap-3-snippets
Zignd.html-css-class-completion
## JAVA
redhat.java
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
## Javascript/Typescript
msjsdiag.debugger-for-chrome
chenxsan.vscode-standardjs
dbaeumer.vscode-eslint
ms-vscode.vscode-typescript-tslint-plugin
octref.vetur
xabikos.JavaScriptSnippets
vsmobile.vscode-react-native
## Angular
Angular.ng-template
cyrilletuzi.angular-schematics
Mikael.Angular-BeastCode
# cipchk.ng-alain-extension-pack
# https://github.com/ng-alain/extension-pack/
cipchk.ng-zorro-vscode
cipchk.ng-alain-vscode
cyrilletuzi.angular-schematics
infinity1207.angular2-switcher
## ionic
loiane.ionic-extension-pack
vsmobile.cordova-tools
## kubernete/docker
ms-kubernetes-tools.vscode-kubernetes-tools
PeterJausovec.vscode-docker
## latex
James-Yu.latex-workshop
## Markdown
DavidAnson.vscode-markdownlint
shd101wyy.markdown-preview-enhanced
yzhang.markdown-all-in-one
darkriszty.markdown-table-prettify
## nginx
shanoor.vscode-nginx
## Node
eg2.vscode-npm-script
leizongmin.node-module-intellisense
## PHP
ikappas.composer
ikappas.phpcs
felixfbecker.php-debug
junstyle.php-cs-fixer
## plsql
xyz.plsql-language
## python
ms-python.anaconda-extension-pack
ms-python.python
## powershell
ms-vscode.PowerShell
## ruby
rebornix.ruby
## linux/shell/vim
vscodevim.vim
## XML/JSON/GraphQL/YAML
DotJoshJohnson.xml
eriklynd.json-tools
mohsen1.prettify-json
kumar-harsh.graphql-for-vscode
redhat.vscode-yaml
# Vesion Control
johnstoncode.svn-scm
codezombiech.gitignore
donjayamanne.githistory
eamodio.gitlens
pflannery.vscode-versionlens
# Extra functionality
bukas.GBKtoUTF8
steoates.autoimport
WakaTime.vscode-wakatime
# Extra tools
MS-CEINTL.vscode-language-pack-zh-hans
ms-vsliveshare.vsliveshare
Shan.code-settings-sync
formulahendry.code-runner
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
humao.rest-client
joelday.docthis
k--kato.docomment
mkxml.vscode-filesize
quicktype.quicktype
wayou.vscode-todo-highlight